In [12]:
import pandas as pd
items = {'year' : pd.Series(data = [1990,1990,1990,1991,1991,1991,1992,1992,1992]),'name':pd.Series(data=['alice','bob','charlie','alice','bob','charlie','alice','bob','charlie']),'department':pd.Series(data=['hr','rd','admin','hr','rd','admin','admin','rd','hr']),'age':pd.Series(data=[25,35,45,26,36,46,27,37,47]),'salary':pd.Series(data=[45000,50000,60000,47000,52000,62000,49000,55000,65000])

}
emp_data = pd.DataFrame(items,index=[0,1,2,3,4,5,6,7,8])
emp_data

   year     name department  age  salary
0  1990    alice         hr   25   45000
1  1990      bob         rd   35   50000
2  1990  charlie      admin   45   60000
3  1991    alice         hr   26   47000
4  1991      bob         rd   36   52000
5  1991  charlie      admin   46   62000
6  1992    alice      admin   27   49000
7  1992      bob         rd   37   55000
8  1992  charlie         hr   47   65000

In [16]:
emp_data.groupby(['year'])['salary'].sum()

year
1990    155000
1991    161000
1992    169000
Name: salary, dtype: int64

In [17]:
emp_data.groupby(['name'])['salary'].sum()

name
alice      141000
bob        157000
charlie    187000
Name: salary, dtype: int64

In [18]:
emp_data.groupby(['year', 'department'])['salary'].sum()

year  department
1990  admin         60000
      hr            45000
      rd            50000
1991  admin         62000
      hr            47000
      rd            52000
1992  admin         49000
      hr            65000
      rd            55000
Name: salary, dtype: int64